# episode1.rpy
#
# Здесь находится сценарий второго эпизода
#


label episode2:
    #TODO: [*Фон «camp night»*]
    #TODO: [*Саундтрек «TODO: Сюда вписать название саундтрека» (на повторе)*]
    "Спустя какое-то время мы доехали до места отеля."
    "И, если честно, это место никак не было похоже на отель."
    "Либо это Валера попутал определения «лагерь» и «отель»…"
    "…или это у меня какие-то шаблонные представления об отелях."
    "Территория выглядела, как большой лагерь, засеянный маленькими деревянными домиками."
    "Парковка, на которой мы остановились, выглядела довольно приятно, на удивление даже не замусорена."
    "Но если говорить в общем, то отелем тут и не пахло."
    "Мы все вышли из машины."
    show valera smile
    va "Все идём за мной!"
    hide valera
    "Собравшись все в одну группу, Валера повёл нас в сторону этого отеля."
    "Похоже, Валера вёл нас в сторону главного здания."
    "Как я понял из разговора среди идущих ребят, это – кемпинг."
    "Что-то вроде отеля, только вместо номеров тебе предоставляют домики на открытой территории."
    "И цены за один такой домик примерно такой же, как и за номер в нормальном отеле."
    "Что ж, от этой поездки теперь можно найти свои плюсы. "
    "Например, теперь я стал знать больше о местах отдыха. "
    "Я шёл позади всех, отделившись от ребят. "
    "Пока что не было ничего интересного. "
    "Но то, что я в кои-то веки выбрался из своего убежища, уже прогресс."
    "Если бы не эта сходка, я бы, наверное, и дальше прятался в четырёх стенах своего дома. "
    "Из раздумий меня вывел женский голос. "
    #[*Спрайт Вика, улыбается*]
    show vika smile
    vi "Чего, как не родной? "
    "Это была Вика. "
    "Она смотрела на меня и улыбалась. "
    "Я же, по своей привычке, отвёл от неё взгляд, устремив его на здание, к которому нас ведёт Валера. "
    i "Да нет, всё нормально."
    i "Решила снова меня вопросами изнасиловать? "
    #[*Спрайт Вика, хмурая*]
    show vika frowning
    vi "А что, нельзя? "
    i "Да можно. "
    "В это время я косо посмотрел на Вику. "
    "Я сразу не смог понять, то ли я её как-то обидел, то ли она сама по себе такая. "
    "Хотя, со стороны, мой вопрос и правда прозвучал немного грубовато.  "
    "Если припомнить, то кто-то мне в ЛС писал, что Вика в реале – та ещё цундере. "
    "И если слова того человека – правда, то впредь нужно будет подумать, прежде чем что-то ляпнуть. "
    #[*Спрайт Вика, улыбается*]
    show vika smile
    "Вика вдруг снова заулыбалась своей лучезарной улыбкой. "
    "Такая резкая смена эмоций... "
    vi "Я просто заметила, что ты от нас отделился, да и Марина с Валерой заволновались. "
    i "Ну, извини, что побеспокоил… "
    vi "Только не думай, что я к тебе подошла, потому что забеспокоилась! "
    "Ну, точно цундере… "
    i "Да я и не думал об этом… "
    #TODO: [*Спрайт Вика, улыбается*] ## Нахера второй раз?
    vi "Вот и славно. Давай, топай к нам. "
    #[*Спрайт исчезает*]
    hide vika
    "Я посмотрел ей вслед. "
    "Странная девушка. "
    "Хоть у неё и есть признаки цундере, но от классических девочек из аниме она всё же отличается. "
    "Эдакая не злая цундере. По-другому никак её не назвать. "
    "Хотя, чего это я… "
    "Сейчас бы сравнивать реальных людей с аниме-персонажами… "
    "Мы подошли к какому-то зданию, похожему на администрацию."
    "Нас встретила владелица кемпинга, вежливо здороваясь. "
    "Валера быстро подскочил к ней. "
    "Они о чём-то оживлённо беседовали, после чего зашли внутрь здания. "
    "Так прошло 10 минут… "
    "Валера, наконец, вышел из кабинета. "
    #[*Спрайт Валера, широкая улыбка*]
    show valera smile
    "На его лице была широкая улыбка "
    va "Отлично, наши домики как раз рядом. "
    va "Деньги потом отдадите. "
    va "Забирайте ключи. "
    "Валера помахал ключами перед друзьями. Они звонко забренчали в его руке. "
    "Парниша успешно раздал всем по ключу, и ребята отправились по указанной тропинке к домикам. "
    "Я подошёл к Валере самым последним. "
    "Протянул ему руку, а тот в свою очередь отдал ключ от домика. "
    i "Сложно было выпросить домики? "
    #TODO: [*Спрайт Валера, стандарт*]
    show valera norm
    va "Совершенно нет, она – милая женщина, да и почему-то сюда никто не приехал. "
    i "Дорого вышло? "
    #TODO: [*Спрайт Валера, широкая улыбка*]
    show valera smile
    va "Потом скажу! "
    "Валера снова широко улыбнулся и побежал вперёд. "
    #TODO: [*Спрайт исчезает*]
    hide valera
    "Мы немного прошлись, Валера указал всем, где кто будет жить, и все пошли располагаться. "
    "Я подошел к своему домику, повернул ключ в замке, открыл дверь и вошёл. "
    #TODO: [*Фон «camp room»]
    "Внутри меня встретила старая деревянная кровать, маленький столик, стул да и все. "
    "Придется немного почувствовать себя аскетом.  "
    "Был еще камин, в котором ничего не горело, но тем не менее в комнате было достаточно тепло. По крайней мере лучше чем на улице."
    "Я вздохнул. "
    i "Ну, да. "
    i "Весело, конечно, без телевизора будет… "
    i "Хорошо, что на телефоне Интернет безлимитный. "
    "Я достал телефон из кармана своей куртки. "
    "Индикатор сигнала связи предательски показывал, что сеть в лагере отсутствует. "
    "Я с некоторой раздражённостью кинул телефон на кровать и плюхнулся на неё. "
    "Мне стало скучно и немного грустно. Возможно лучше было бы остаться дома. Когда разлучают с компьютером, так и хочеться во все поиграть или посмотреть какое-то аниме. "
    "Спустя 10 минут увлекательного просмотра потолка я таки начал располагаться в своём «номере». "
    "Расчехлил свой рюкзак, достал оттуда вещи и временно поставил их на стол. "
    #[Звук door knock]
    play sound knock
    "Меня отвлек внезапный стук в дверь."
    play sound door
    "Я подошёл к двери и открыл её. "
    "Это была Марина. "
    #[*Спрайт Марины, смущённая*]
    show marina embrass
    m "Ой, прости, что беспокою… "
    m "Но не найдётся ли у тебя ещё одной зарядки… "
    m "А то глупая и забыла её... "
    "Марина заметно покраснела. "
    "Называть себя глупой из-за того, что забыла зарядку?.. "
    "Но, её смущённое лицо довольно милое… "
    i "А у других нет? "
    m "Ну, эм… "
    m "Я спрашивала у ребят…"
    m "Ни одна не подходит, и вот… "
    m "На тебя вся надежда… "
    "Я посмотрел на её телефон, который она держала в руках. "
    "Айфон… "
    "Ей сегодня повезло, ибо телефон у меня такой же и я взял зарядку."
    "Я поплёлся к рюкзаку, достал оттуда зарядку и передал её Марине."
    "Стало немного спокойнее, приятно почувствовать себя полезным. Правда мне самому бы не помешало зарядить свой телефон..."
    #[*Спрайт Марины, радость*]
    show marina happy
    m "Ой, спасибо большое~ "
    "Марина внезапно обняла меня и побежала к своему домику. "
    "Я на пару секунд онемел, сердце билось немного быстрее."
    "Меня ведь просто по-дружески обняли. Но это внезапно оказалось намного приятнее, чем я думал. Не зря пожертвовал зарядом своего телефона."
    "Я закрыл дверь и продолжил раскладывать свои вещи. "
    "Всё равно сети здесь нет. Смысла от телефона в этом элитном базе отдыха, не больше чем в моём существовании. "
    #TODO: [*Конец саундтрека*]
    #TODO: [*Плавное исчезновение фона*]
    #TODO: [*Фон «camp night»*]
    "Немного позже мы все собрались около наших домиков. "
    "Я не понимал какие у всех планы на эту поездку, но одно было известно точно – мы приехали сюда хорошо проводить время. "
    "А уже каким образом, как я понял, решится по ходу дела. "
    "Пока что просто пошли гулять по окрестностям. "
    i "Ну, и чем мы займёмся? "
    #[*Спрайты Марины, Вики и Валеры*]
    show valera norm at right
    show vika norm at left
    show marina norm
    vi "Как, чем? Веселиться, конечно же! "
    i "Не шибко тут и весело, скажу я…"
    #[*Спрайт Вики, хмурая*]
    show vika frowning at left
    vi "Эй, не порть настрой! Валерыч наверняка что-то придумал. Ведь так? "
    va "Да, есть кое-что у меня в планах~ "
    #[*Спрайт Вики, стандарт*]
    show vika norm at left
    vi "Вот видишь! "
    "Я ещё раз осмотрелся. "
    "Лагерь, как лагерь. Ничего необычного. "
    "Даже на ум ничего не приходит, чем тут можно заняться. "
    i "Но, скажи же, вокруг ничего интересного. "
    i "Одни домики, да парковка. "
    i "Будем на парковке хардбасс отплясывать? "
    #[*Спрайт Вики, РЖОМБА*]
    show vika happy at left
    "Вика захохотала. "
    vi "О, наконец заюморил! "
    vi "Как-будто сейчас твоё сообщение в беседе прочитала. "
    "Я ухмыльнулся, это даже не планировалось как шутка, но пускай так и будет."
    m "Мы наверняка сегодня хорошо проведём время. "
    "Слова Марины меня как-то даже подбодрили."
    "И непонятно, каким образом."
    i "Ну, посмотрим."
    #TODO: [*Спрайт Марина, счастливая улыбка ^^*]
    show marina happy
    "Марина улыбнулась мне."
    "А я машинально покраснел и отвернулся."
    "Ей Богу, что со мной не так? Как-будто впервые девушку перед собой увидел."
    "Я уже начинаю подумывать о том, что, возможно, это всё из-за моих задротских посиделок в своей берлоге у компа."
    "Я посмотрел на небо."
    "Густые облака обволакивали весь небесный покров, поэтому ни звёзд, ни Луны видно не было."
    "Зато с неба падал приятный лёгкий снежок."
    "И если бы не громкие разговоры моих новоиспечённых приятелей, то это место было бы самым тихим местом на планете."
    "Может поехать сюда было все же хорошим решением."
    #[*Спрайты исчезают*]
    hide marina
    hide valera
    hide vika
    "Валера вёл нас к зданию администрации."
    "Парень говорил, что ему было что-то нужно от директора."
    "Скорее всего, речь зайдёт о выходе за территорию кемпинга, так как ещё во время нашей поездки Валера говорил что-то про разжигание костра."
    "И эта идея мне показалась неплохой."
    "Это намного лучше, чем тупо пинать болт на территории, где нет никаких мест для развлечений."
    "Наконец, мы пришли в администрацию. "
    #TODO: [*Переход на фон “ЖК телек с новостями”*]
    "Девушка-администратор поприветствовала нас, но первое, что привлекло моё внимание, был телевизор. "
    #TODO: [*Саундтрек “Название саундтрека” (на повторе)*]
    "Пока Валера разбирался со своими вопросами, я с остальными смотрел выпуск новостей."
    "На экране, внизу, крупными буквами написано “СРОЧНЫЕ НОВОСТИ”, а на фоне говорящего диктора было изображение с астероидом над планетой и какими-то снимками с подписью “NASA”."
    d "Во время эфира нам поступили срочные новости."
    d "Учёные буквально несколько минут назад обнаружили космический объект, который направляется в сторону нашей планеты - данную информацию сообщают из ведомства “NASA”."
    d "По словам учёных, это астероид диаметром 200-220 километров и движется в сторону Земли со скоростью 20 километров в секунду."
    d "Как подобный объект не был обнаружен ранее - неизвестно. Ведомство “NASA” сообщает о том, что от столкновения такого объекта с Землёй на планете не останется ничего живого, поэтому, по словам главы ведомства Джима Брайденстайна, “Нам остаётся лишь надеяться, что расчёты движения астероида ложные”."
    d "На данный момент в “NASA” перепроверяют данные об объекте. Мы будем следить за развитием событий."
    #TODO: [*Переход на фон “camp day”*]
    "После этого диктор продолжил говорить о повседневных новостях."
    "Да и я уже не слушал голос из телевизора."
    "Внутри меня было какое-то непонятное чувство."
    "Подобные новости о “конце света” не часто услышишь, да и заканчивались они как-то не очень."
    "Ну, то есть, никакой из концов света и концом никаким не был на самом деле."
    "Но сейчас что-то заставило меня застыть с приоткрытым ртом."
    "Неужели я поверил в это?"
    "Ну, да, инфа об астероиде, который заваншотит всех жителей планеты, любого заставит волноваться."
    "Даже меня, не верующего в это."
    "Тут я вспомнил, что я в холле не один. Я повернулся к ребятам."
    "Все трое, как и я до этого, стояли, замерев, как вкопанные."
    #[*Спрайт Валеры, грустный*]
    show valera sad
    "Опечаленный взгляд Валеры не отрывался от телевизора."
    "Было заметно, как его руки дрожали."
    "Похоже, что он поверил в это больше всех из нас."
    #[*Спрайт Марины, грустная*]
    show marina sad at right
    "Марина тоже была грустная."
    "Её глаза смотрели себе под ноги."
    "Даже казалось, что она вот-вот заплачет."
    #[*Спрайт Вики, задумчивая*]
    show vika thicc at left
    "Вика же, наоборот, была максимально задумчивой."
    "Она молча посмотрела на меня."
    "Интересно, о чём она сейчас думает?"
    "Так прошла минута."
    "Обстановка была так себе, молчание лишь напрягало."
    "Первой не выдержала администратор. С волнением в голосе она сказала, что это лишь ошибка."
    "Она, возможно, и сама не верила своим словам, однако её инициативу я не мог не подхватить."
    i "Ребят, вы чё, реально поверили? Очередной же фейк."
    va "Ну, даже не знаю…"
    "Валера всё не мог прийти в себя."
    "В его глазах всё ещё прослеживалась обеспокоенность."
    "Марина, наконец, подняла голову и посмотрела на всех. На её глазах наворачивались слёзы."
    m "Но ведь…"
    m "Про такое врать не должны…"
    m "Неужели.. это всё?.."
    "Так, это не дело."
    "Верить в такое - уже перебор."
    #TODO: [*Конец саундтрека*]
    i "Да брось. Всё нормально."
    i "Это точно фейк. Если бы все эти новости были правдой, мы бы уже давно все поумирали."
    "Валера хотел что-то возразить, но тут вмешалась Вика."
    vi "Серёжа прав. Какие, к чёрту, астероиды?"
    vi "Наверняка, очередная попытка нас напугать."
    #[*Спрайт Вика, улыбается*]
    show vika smile at left
    "Вика улыбнулась и, подойдя к Марине, приобняла её за плечи."
    "Марине же, вроде, полегчало. Она вытерла слёзы с глаз."
    m "И правда… Чего это я…"
    #[*Спрайт Марина, улыбается*]
    show marina smile at right
    "Марина легонько вздохнула и улыбнулась."
    "Ну, вот. Обошлось без паники."
    "Я посмотрел на Валеру."
    #[*Спрайт Валеры, позитивный приоткрытый рот*]
    show valera smile
    "Того, походу, отпустило. Он широко улыбался."
    "То ли и правда до него дошло, что это фейк, либо он так себя успокаивал."
    "Я не стал ему ничего говорить."
    "Обычно такие простаки, как он, не заостряют внимание на подобные вещи."
    "Так что, если у него и были какие безысходные мысли по поводу астероида, то они наверняка развеются без чьей-либо помощи."
    va "Ну, что ж... *издаёт смешок* ...Подбодрились пугающей новостью под ночь, а теперь идём расслабляться."
    vi "Да, мы же хотели костёр развести! Идём скорее!"
    #[*Спрайты Вика и Марина исчезают*]
    hide vika
    hide marina
    "Я вздохнул и посмотрел на Валеру."
    "Тот тоже шёл на выход."
    i "Валер. Точно, всё нормально?"
    "Валера посмотрел на меня с улыбкой."
    va "Да, всё путём. Идём, а то девки без нас начнут веселиться."
    #[*Спрайт Валера исчезает*]
    hide valera
    "Я вышел следом, направляясь за парнем."
    "Мда уж, умеют ведь в новостях напугать."
    "И никакая хоррор-игра не сравнится с этим."
    "В глубине души оставались мысли о том, что эта новость может быть не выдумкой."
    "Но я решил смахнуть эти мысли в сторону. Фейк это, и точка."
    "Резко покрутив головой и похлопав себя по щекам, я ускорил шаг."
    #TODO: [*Плавное исчезновение фона*]

    return
